Revit 2024 API
BoundaryValidation Properties
The BoundaryValidation type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BoundaryValidation Class
Autodesk.Revit.DB Namespace